zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/svd/PIC32CZ1038CA70100.svd
            <register>
               <name>PWMC_FPV1</name>
               <description>PWMC Fault Protection Value Register 1</description>
               <addressOffset>0x68</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FPVH0</name>
                     <description>Fault Protection Value for PWMH output on channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPVH1</name>
                     <description>Fault Protection Value for PWMH output on channel 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPVH2</name>
                     <description>Fault Protection Value for PWMH output on channel 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPVH3</name>
                     <description>Fault Protection Value for PWMH output on channel 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPVL0</name>
                     <description>Fault Protection Value for PWML output on channel 0</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPVL1</name>
                     <description>Fault Protection Value for PWML output on channel 1</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPVL2</name>
                     <description>Fault Protection Value for PWML output on channel 2</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPVL3</name>
                     <description>Fault Protection Value for PWML output on channel 3</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWMC_FPE</name>
               <description>PWMC Fault Protection Enable Register</description>
               <addressOffset>0x6C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FPE0</name>
                     <description>Fault Protection Enable for channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>FPE1</name>
                     <description>Fault Protection Enable for channel 1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>FPE2</name>
                     <description>Fault Protection Enable for channel 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>FPE3</name>
                     <description>Fault Protection Enable for channel 3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>PWMC_ELMR</name>
               <description>PWMC Event Line 0 Mode Register 0</description>
               <addressOffset>0x7C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CSEL0</name>
                     <description>Comparison 0 Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSEL1</name>
                     <description>Comparison 1 Selection</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSEL2</name>
                     <description>Comparison 2 Selection</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSEL3</name>
                     <description>Comparison 3 Selection</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSEL4</name>
                     <description>Comparison 4 Selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSEL5</name>
                     <description>Comparison 5 Selection</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSEL6</name>
                     <description>Comparison 6 Selection</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSEL7</name>
                     <description>Comparison 7 Selection</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWMC_SSPR</name>
               <description>PWMC Spread Spectrum Register</description>
               <addressOffset>0xA0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SPRD</name>
                     <description>Spread Spectrum Limit Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
                  <field>
                     <name>SPRDM</name>
                     <description>Spread Spectrum Counter Mode</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWMC_SSPUP</name>
               <description>PWMC Spread Spectrum Update Register</description>
               <addressOffset>0xA4</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>SPRDUP</name>
                     <description>Spread Spectrum Limit Value Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWMC_SMMR</name>
               <description>PWMC Stepper Motor Mode Register</description>
               <addressOffset>0xB0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>GCEN0</name>
                     <description>Gray Count ENable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GCEN1</name>
                     <description>Gray Count ENable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DOWN0</name>
                     <description>DOWN Count</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DOWN1</name>
                     <description>DOWN Count</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWMC_FPV2</name>
               <description>PWMC Fault Protection Value 2 Register</description>
               <addressOffset>0xC0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FPZH0</name>
                     <description>Fault Protection to Hi-Z for PWMH output on channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPZH1</name>
                     <description>Fault Protection to Hi-Z for PWMH output on channel 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPZH2</name>
                     <description>Fault Protection to Hi-Z for PWMH output on channel 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPZH3</name>
                     <description>Fault Protection to Hi-Z for PWMH output on channel 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPZL0</name>
                     <description>Fault Protection to Hi-Z for PWML output on channel 0</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPZL1</name>
                     <description>Fault Protection to Hi-Z for PWML output on channel 1</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPZL2</name>
                     <description>Fault Protection to Hi-Z for PWML output on channel 2</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPZL3</name>
                     <description>Fault Protection to Hi-Z for PWML output on channel 3</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWMC_WPCR</name>
               <description>PWMC Write Protection Control Register</description>
               <addressOffset>0xE4</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>WPCMD</name>
                     <description>Write Protection Command</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLE_SW_PROT</name>
                           <description>Disables the software write protection of the register groups of which the bit WPRGx is at '1'.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE_SW_PROT</name>
                           <description>Enables the software write protection of the register groups of which the bit WPRGx is at '1'.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE_HW_PROT</name>
                           <description>Enables the hardware write protection of the register groups of which the bit WPRGx is at '1'. Only a hardware reset of the PWM controller can disable the hardware write protection. Moreover, to meet security requirements, the PORT lines associated with the PWM can not be configured through the PORT interface.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WPRG0</name>
                     <description>Write Protection Register Group 0</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPRG1</name>
                     <description>Write Protection Register Group 1</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPRG2</name>
                     <description>Write Protection Register Group 2</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPRG3</name>
                     <description>Write Protection Register Group 3</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPRG4</name>
                     <description>Write Protection Register Group 4</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPRG5</name>
                     <description>Write Protection Register Group 5</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of the WPCMD field.Always reads as 0</description>
                           <value>0x50574D</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWM_WPSR</name>
               <description>PWMC Write Protection Status Register</description>
               <addressOffset>0xE8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WPSWS0</name>
                     <description>Write Protect SW Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPSWS1</name>
                     <description>Write Protect SW Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPSWS2</name>
                     <description>Write Protect SW Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPSWS3</name>
                     <description>Write Protect SW Status</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPSWS4</name>
                     <description>Write Protect SW Status</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPSWS5</name>
                     <description>Write Protect SW Status</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPVS</name>
                     <description>Write Protect Violation Status</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPHWS0</name>
                     <description>Write Protect HW Status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPHWS1</name>
                     <description>Write Protect HW Status</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPHWS2</name>
                     <description>Write Protect HW Status</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPHWS3</name>
                     <description>Write Protect HW Status</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPHWS4</name>
                     <description>Write Protect HW Status</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPHWS5</name>
                     <description>Write Protect HW Status</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPVSRC</name>
                     <description>Write Protect Violation Source</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>8</dim>
               <dimIncrement>16</dimIncrement>
               <name>PWMC_CMP</name>
               <description>PWMC Comparison 0 Value Register</description>
               <addressOffset>0x130</addressOffset>
               <register>
                  <name>PWMC_CMPV</name>
                  <description>PWMC Comparison 0 Value Register</description>
                  <addressOffset>0x00</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>CV</name>
                        <description>Comparison x Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>24</bitWidth>
                     </field>
                     <field>
                        <name>CVM</name>
                        <description>Comparison x Value Mode</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PWMC_CMPVUPD</name>
                  <description>PWMC Comparison 0 Value Update Register</description>
                  <addressOffset>0x04</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <fields>
                     <field>
                        <name>CVUPD</name>
                        <description>Comparison x Value Update</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>24</bitWidth>
                     </field>
                     <field>
                        <name>CVMUPD</name>
                        <description>Comparison x Value Mode Update</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PWMC_CMPM</name>
                  <description>PWMC Comparison 0 Mode Register</description>
                  <addressOffset>0x08</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>CEN</name>
                        <description>Comparison x Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CTR</name>
                        <description>Comparison x Trigger</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>CPR</name>
                        <description>Comparison x Period</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>CPRCNT</name>
                        <description>Comparison x Period Counter</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>CUPR</name>
                        <description>Comparison x Update Period</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>CUPRCNT</name>
                        <description>Comparison x Update Period Counter</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                  </fields>
               </register>
