zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/svd/PIC32CZ1038CA70100.svd
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WKUPIS10</name>
                     <description>WKUPx Input Status (cleared on read)</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WKUPIS11</name>
                     <description>WKUPx Input Status (cleared on read)</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WKUPIS12</name>
                     <description>WKUPx Input Status (cleared on read)</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WKUPIS13</name>
                     <description>WKUPx Input Status (cleared on read)</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>The corresponding wakeup input is disabled, or was inactive at the time the debouncer triggered a wakeup event.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>The corresponding wakeup input was active at the time the debouncer triggered a wakeup event since the last read of SUPC_SR.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>TC0</name>
         <version>6082ZL</version>
         <description>Timer Counter</description>
         <groupName>TC</groupName>
         <prependToName>TC_</prependToName>
         <baseAddress>0x4000C000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xE8</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>TC0_CH0</name>
            <value>23</value>
         </interrupt>
         <interrupt>
            <name>TC0_CH1</name>
            <value>24</value>
         </interrupt>
         <interrupt>
            <name>TC0_CH2</name>
            <value>25</value>
         </interrupt>
         <registers>
            <cluster>
               <dim>3</dim>
               <dimIncrement>64</dimIncrement>
               <name>TC_CHANNEL</name>
               <description>Channel Control Register (channel = 0)</description>
               <addressOffset>0x0</addressOffset>
               <register>
                  <name>TC_CCR</name>
                  <description>Channel Control Register (channel = 0)</description>
                  <addressOffset>0x00</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <fields>
                     <field>
                        <name>CLKEN</name>
                        <description>Counter Clock Enable Command</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CLKDIS</name>
                        <description>Counter Clock Disable Command</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SWTRG</name>
                        <description>Software Trigger Command</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
