zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/svd/PIC32CZ1038CA70100.svd
                              <description>TOGGLE</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>BCPC</name>
                        <description>RC Compare Effect on TIOBx</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>NONE</name>
                              <description>NONE</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SET</name>
                              <description>SET</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CLEAR</name>
                              <description>CLEAR</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TOGGLE</name>
                              <description>TOGGLE</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>BEEVT</name>
                        <description>External Event Effect on TIOBx</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>NONE</name>
                              <description>NONE</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SET</name>
                              <description>SET</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CLEAR</name>
                              <description>CLEAR</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TOGGLE</name>
                              <description>TOGGLE</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>BSWTRG</name>
                        <description>Software Trigger Effect on TIOBx</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>NONE</name>
                              <description>NONE</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SET</name>
                              <description>SET</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CLEAR</name>
                              <description>CLEAR</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TOGGLE</name>
                              <description>TOGGLE</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>TC_SMMR</name>
                  <description>Stepper Motor Mode Register (channel = 0)</description>
                  <addressOffset>0x08</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>GCEN</name>
                        <description>Gray Count Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DOWN</name>
                        <description>Down Count</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>TC_RAB</name>
                  <description>Register AB (channel = 0)</description>
                  <addressOffset>0x0C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>RAB</name>
                        <description>Register A or Register B</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>TC_CV</name>
                  <description>Counter Value (channel = 0)</description>
                  <addressOffset>0x10</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>CV</name>
                        <description>Counter Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>TC_RA</name>
                  <description>Register A (channel = 0)</description>
                  <addressOffset>0x14</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>RA</name>
                        <description>Register A</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>TC_RB</name>
                  <description>Register B (channel = 0)</description>
                  <addressOffset>0x18</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>RB</name>
                        <description>Register B</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>TC_RC</name>
                  <description>Register C (channel = 0)</description>
                  <addressOffset>0x1C</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>RC</name>
                        <description>Register C</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>TC_SR</name>
                  <description>Status Register (channel = 0)</description>
                  <addressOffset>0x20</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>COVFS</name>
                        <description>Counter Overflow Status (cleared on read)</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LOVRS</name>
                        <description>Load Overrun Status (cleared on read)</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CPAS</name>
                        <description>RA Compare Status (cleared on read)</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CPBS</name>
                        <description>RB Compare Status (cleared on read)</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CPCS</name>
                        <description>RC Compare Status (cleared on read)</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LDRAS</name>
                        <description>RA Loading Status (cleared on read)</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LDRBS</name>
                        <description>RB Loading Status (cleared on read)</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ETRGS</name>
                        <description>External Trigger Status (cleared on read)</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CLKSTA</name>
                        <description>Clock Enabling Status</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MTIOA</name>
                        <description>TIOAx Mirror</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MTIOB</name>
                        <description>TIOBx Mirror</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>TC_IER</name>
                  <description>Interrupt Enable Register (channel = 0)</description>
                  <addressOffset>0x24</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <fields>
                     <field>
                        <name>COVFS</name>
                        <description>Counter Overflow</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LOVRS</name>
                        <description>Load Overrun</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CPAS</name>
                        <description>RA Compare</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CPBS</name>
                        <description>RB Compare</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CPCS</name>
                        <description>RC Compare</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LDRAS</name>
                        <description>RA Loading</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LDRBS</name>
                        <description>RB Loading</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ETRGS</name>
                        <description>External Trigger</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>TC_IDR</name>
                  <description>Interrupt Disable Register (channel = 0)</description>
                  <addressOffset>0x28</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <fields>
                     <field>
                        <name>COVFS</name>
                        <description>Counter Overflow</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LOVRS</name>
                        <description>Load Overrun</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CPAS</name>
                        <description>RA Compare</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CPBS</name>
                        <description>RB Compare</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CPCS</name>
                        <description>RC Compare</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LDRAS</name>
                        <description>RA Loading</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LDRBS</name>
                        <description>RB Loading</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ETRGS</name>
                        <description>External Trigger</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>TC_IMR</name>
                  <description>Interrupt Mask Register (channel = 0)</description>
                  <addressOffset>0x2C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>COVFS</name>
                        <description>Counter Overflow</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LOVRS</name>
                        <description>Load Overrun</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CPAS</name>
                        <description>RA Compare</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CPBS</name>
                        <description>RB Compare</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CPCS</name>
                        <description>RC Compare</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LDRAS</name>
                        <description>RA Loading</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LDRBS</name>
                        <description>RB Loading</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ETRGS</name>
                        <description>External Trigger</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>TC_EMR</name>
                  <description>Extended Mode Register (channel = 0)</description>
                  <addressOffset>0x30</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>TRIGSRCA</name>
                        <description>Trigger Source for Input A</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>EXTERNAL_TIOAx</name>
                              <description>The trigger/capture input A is driven by external pin TIOAx</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PWMx</name>
                              <description>The trigger/capture input A is driven internally by PWMx</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>TRIGSRCB</name>
                        <description>Trigger Source for Input B</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>EXTERNAL_TIOBx</name>
                              <description>The trigger/capture input B is driven by external pin TIOBx</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PWMx</name>
                              <description>For TC0 to TC10: The trigger/capture input B is driven internally by the comparator output (see Figure 7-16) of the PWMx.For TC11: The trigger/capture input B is driven internally by the GTSUCOMP signal of the Ethernet MAC (GMAC).</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>NODIVCLK</name>
                        <description>No Divided Clock</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <name>TC_BCR</name>
               <description>Block Control Register</description>
               <addressOffset>0xC0</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>SYNC</name>
                     <description>Synchro Command</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
